<?php

return [

    'title' => [
        'index' => 'Администраторы',
        'create' => 'Создать',
        'edit' => 'Изменить',
        'search' => 'Поиск',
    ],

    'button' => [
        'create' => 'Создать'
    ],

    'notification' => [
        'status-change-update' => 'Статус администратора успешно изменен',
        'user-created-success' => 'Новый администратор успешно создан',
        'user-delete' => 'Администратор удален',
        'user-update' => 'Данные администратора обновлены',
    ],

    'search' => [
        'placeholder' => 'Эл.адрес для поиска',
        'no-results' => 'Нет результатов',
        'table' => [
            'name' => 'Имя',
            'email' => 'Эл.адрес',
            'role' => 'Права',
            'created' => 'Дата создания',
            'options' => 'Действия',
        ],
    ],

    'tooltip' => [
        'status' => 'Изменить статус',
        'edit' => 'Редактировать',
        'delete' => 'Удалить',
    ],

    'confirm' => [
        'activate' => 'Вы хотите активировать этого пользователя?',
        'deactivate' => 'Вы хотите деактивировать этого пользователя?',
        'delete' => 'Вы хотите удалить этого пользователя?',
    ],

    'index' => [
        'title' => 'Администраторы',
    ],

    'create' => [
        'title' => 'Создание нового администратора',
        'form' => [
            'name' => 'Имя',
            'email' => 'Эл.адрес',
            'password' => 'Пароль',
            'submit' => 'Создать',
        ],
    ],

    'edit' => [
        'title' => 'Редактирование',
        'form' => [
            'submit' => 'Изменить',
            'change_password' => 'Сменить пароль',
        ],
    ],

];
